Documents/ЗаявкаНаАрендуПП_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаявкаНаАрендуПП_ат</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействиеПоЗаявкеНаАрендуПП_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПодчиненные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКлиентов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тикет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АрендуемыеПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоставкаПП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродуктыДляАренды_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыЗаявокНаАренду_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаявокНаАренду_ат</Name>
			<Comment>!!!!!HOTFIX + переименовать</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтатусовЗаявокНаАренду_ат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаАрендуОборудования_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаАрендуПП_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСтатусовЗаявокНаАренду_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыСтатусовЗаявокНаАренду_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненаСИзменениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаТехническомСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаФинансовомСогласовании</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаАрендуПП_ат/Ext/ObjectModule.bsl
Перем ЭтоНовый;
Перем ЭтоТекущийСтатус;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаявокНаАренду_атСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.СтатусыЗаявокНаАренду_ат.СрезПоследних КАК СтатусыЗаявокНаАренду_атСрезПоследних
	|ГДЕ
	|	СтатусыЗаявокНаАренду_атСрезПоследних.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() тогда 
		
		ЭтоТекущийСтатус = Неопределено;
		
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЭтоТекущийСтатус =  ВыборкаДетальныеЗаписи.Статус;
		КонецЦикла;	
	КонецЕсли;

	
	
	ЭтоНовый = ЭтоНовый();
	
	Если ЭтоНовый Тогда
		
		УстановитьНовыйНомер();
		
	КонецЕсли;
	
	Если ПустаяСтрока(Тикет) Тогда
		
		Тикет = "П" + Строки_КлиентСервер_ат.ПолучитьНомерТикета(Номер, Дата);
		
	КонецЕсли;

	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ЭтоТекущийСтатус = Неопределено или ЭтоТекущийСтатус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении тогда
		
		ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
		ЗаписьСтатуса.Отбор.Заявка.Установить(ЭтотОбъект.Ссылка);
		
			НаборСведений 				= ЗаписьСтатуса.Добавить();
			НаборСведений.Заявка 		= ЭтотОбъект.Ссылка;
			НаборСведений.Период 		= ТекущаяДата();
			НаборСведений.Статус 		= Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении;
			НаборСведений.Пользователь 	= Пользователи.ТекущийПользователь();
			НаборСведений.Регистратор 	= ЭтотОбъект;
			
		ЗаписьСтатуса.Записать(ложь);
		
	ИначеЕсли ЭтоТекущийСтатус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаТехническомСогласовании тогда
		
		ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
		ЗаписьСтатуса.Отбор.Заявка.Установить(ЭтотОбъект.Ссылка);
		
			НаборСведений 				= ЗаписьСтатуса.Добавить();
			НаборСведений.Заявка 		= ЭтотОбъект.Ссылка;
			НаборСведений.Период 		= ТекущаяДата();
			НаборСведений.Статус 		= Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаТехническомСогласовании;
			НаборСведений.Пользователь 	= Пользователи.ТекущийПользователь();
			НаборСведений.Регистратор 	= ЭтотОбъект;
			
		ЗаписьСтатуса.Записать(ложь);

	ИначеЕсли ЭтоТекущийСтатус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаФинансовомСогласовании  тогда
				
		ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
		ЗаписьСтатуса.Отбор.Заявка.Установить(ЭтотОбъект.Ссылка);
		
			НаборСведений 				= ЗаписьСтатуса.Добавить();
			НаборСведений.Заявка 		= ЭтотОбъект.Ссылка;
			НаборСведений.Период 		= ТекущаяДата();
			НаборСведений.Статус 		= Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаФинансовомСогласовании;
			НаборСведений.Пользователь 	= Пользователи.ТекущийПользователь();
			НаборСведений.Регистратор 	= ЭтотОбъект;
			
		ЗаписьСтатуса.Записать(ложь);

	Иначе 
		Сообщить("Этот документ прошел согласование, его нельзя отменить!!!", СтатусСообщения.ОченьВажное);
		отказ = истина;
	КонецЕсли;
	
	
КонецПроцедуры
